_site/2016/04/04/mysql安装.html
<!DOCTYPE html>
<html>

  <head>
  <title>ubuntu安装mysql</title>
  <!-- link to main stylesheet -->
  <link rel="stylesheet" type="text/css" href="/assets/css/main.css">
  <link rel="stylesheet" type="text/css" href="/assets/css/font-awesome-4.6.1/css/font-awesome.min.css">
</head>


  <body>
    <article class="content">
      <h1 class="post-title">ubuntu安装mysql</h1>
      <p>
        
        
        
      </p>

      <div id="outline-container-sec-1" class="outline-2">
    <h2 id="sec-1">1. mysql安装</h2>
    <div class="outline-text-2" id="text-1">
	<p>
	    在Ubuntu上的安装跟其他包一样。mysql分为server和client，在安装server的时候会自动安装client。
	</p>
	<div class="org-src-container">

	    <pre class="src src-sh">sudo apt-get update
sudo apt-get upgrade
sudo apt-get install mysql-server
	    </pre>
	</div>
	<p>
	    默认情况下，mysql server只允许本地localhost(127.0.0.1)连接，如果需要通过ssh远程连接上数据库的话，需要修改配置文件my.conf的bind-address参数。
	</p>
    </div>
</div>
<div id="outline-container-sec-2" class="outline-2">
    <h2 id="sec-2">2. 增强mysql的安全性</h2>
    <div class="outline-text-2" id="text-2">
	<div class="org-src-container">

	    <pre class="src src-sh">sudo mysql_secure_installation
	    </pre>
	</div>
	<p>
	    这个脚本会问一些问题，然后给出可以选择的选项，比如说为root用户添加密码、只允许root在localhost上登录、删除匿名用户和test数据库等。可以看出这些问题的建议答案都是yes，是引导用户增加mysql的安全性。  
	</p>
    </div>
</div>

<div id="outline-container-sec-3" class="outline-2">
    <h2 id="sec-3">3. mysql使用</h2>
    <div class="outline-text-2" id="text-3">
    </div><div id="outline-container-sec-3-1" class="outline-3">
	<h3 id="sec-3-1">3.1 连接mysql server</h3>
	<div class="outline-text-3" id="text-3-1">
	    <div class="org-src-container">

		<pre class="src src-sh">mysql -h host -P port -u user_name -p password
		</pre>
	    </div>
	</div>
    </div>
    <div id="outline-container-sec-3-2" class="outline-3">
	<h3 id="sec-3-2">3.2 连接错误及解决方法</h3>
	<div class="outline-text-3" id="text-3-2">
	</div><div id="outline-container-sec-3-2-1" class="outline-4">
	    <h4 id="sec-3-2-1">3.2.1 Can't connect to MySQL server on '192.168.0.102' (61)</h4>
	    <div class="outline-text-4" id="text-3-2-1">
		<ol class="org-ol">
		    <li>在mysql server机器上尝试本地连接
			<div class="org-src-container">

			    <pre class="src src-sh">mysql -u user_name -p
			    </pre>
			</div>
			<p>
			    如果本地连接可以连接上，说明mysql server是启动并且工作正常的。
			</p>
		    </li>
		    <li>在client端尝试ssh连接server机器
			如果能连上，说明网络是没有问题的。否则查看是不是防火墙设置的问题
		    </li>
		    <li>查看mysql的配置文件
			默认情况下，mysql server只允许本地连接，修改my.conf的bind-address参数为：&lt;code&gt; bind-address = 0.0.0.0 &lt;/code&gt;。bind-address指定ip的话，只允许指定的ip连接mysql server，修改为0.0.0.0的意思是允许所有的ip地址连接上server。
		    </li>
		</ol>
	    </div>
	</div>
	<div id="outline-container-sec-3-2-2" class="outline-4">
	    <h4 id="sec-3-2-2">3.2.2 ERROR 1130 (HY000): Host '192.168.0.100' is not allowed to connect to this MySQL server</h4>
	    <div class="outline-text-4" id="text-3-2-2">
		<p>
		    当前的host不允许连接上server。
		</p>
		<ol class="org-ol">
		    <li>以root用户登录，查看mysql.user表中是不是没有在当前host上有效的user。
			<div class="org-src-container">

			    <pre class="src src-sh"><span style="color: #a020f0;">select</span> User,Host from mysql.user;
			    </pre>
			</div>
			<p>
			    如果没有的话，增加用户并且赋予权限。<a href="#sec-3-3">创建用户</a>
			</p>
		    </li>
		</ol>
	    </div>
	</div>

	<div id="outline-container-sec-3-2-3" class="outline-4">
	    <h4 id="sec-3-2-3">3.2.3 ERROR 1045 (28000): Access denied for user 'guang'@'192.168.0.100' (using password: YES)</h4>
	    <div class="outline-text-4" id="text-3-2-3">
		<p>
		    1.password不对
		</p>
	    </div>
	</div>
    </div>

    <div id="outline-container-sec-3-3" class="outline-3">
	<h3 id="sec-3-3">3.3 创建用户</h3>
	<div class="outline-text-3" id="text-3-3">
	    <p>
		root用户的权限太大，一般都是创建一个新用户，设置密码然后将部分权限下发给新用户，client端以这个用户的身份登录。
	    </p>
	    <div class="org-src-container">

		<pre class="src src-sh">create database testdb;
create user <span style="color: #8b2252;">'testuser'</span>@<span style="color: #8b2252;">'localhost'</span> identified by <span style="color: #8b2252;">'password'</span>;
grant all on testdb.* to <span style="color: #8b2252;">'testuser'</span>;
FLUSH PRIVILEGES;
		</pre>
	    </div>
	    <p>
		上面的命令创建了testuser客户，连接密码是password，允许他在localhost这台机器上登录，给他的权限是对于testdb这个数据库的全部权限。
	    </p>
	</div>
    </div>
</div>

    </article>
  </body>
</html>
